source/hdk2/hdk2/libhdkcli/unittest/tests/HTTP-100/HTTP-100.input.xml

<?xml version="1.0" ?>

<!--
 If not stated otherwise in this file or this component's Licenses.txt file the
 following copyright and licenses apply:

 Copyright 2018 RDK Management

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->

<!--
   Copyright [2014] [Cisco Systems, Inc.]

   Licensed under the Apache License, Version 2.0 (the \"License\");
   you may not use this file except in compliance with the License.
   You may obtain a copy of the License at

       http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing, software
   distributed under the License is distributed on an \"AS IS\" BASIS,
   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
   See the License for the specific language governing permissions and
   limitations under the License.
-->

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
    <SimpleUnittestMethod xmlns="http://cisco.com/Unittest/">
        <StringArg0>
          This is going to be a really long string.  It is really long so the HTTP clients with include the Expect: 100-Continue header
          in their POST HTTP request.  If the POST data is not large enough clients, such as libCURL, will simply include all the POST
          data in the request.
          1
          22
          333
          4444
          55555
          666666
          7777777
          8888888
          99999999



                  |  ,
              `   | ,
                ` |,
             ~~~~ * ~~~~
                , | `
               ,  |   `
                  |     `



                       ^
                      / \`
                     /   \,`
                    /     \,,`
                   /       \,,,`
                  /         \,,,,`
                 /           \,,,,,`
                /             \,,,,,,`
               /               \,,,,,,,`
              /                 \,,,,,,,,`....
             /                   \,,,,,,,..........
            /                     \,,,,,..............
           /                       \,,,............
          /                         \,..........
         /                           \.......
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

            +-+
           /   \
          /     \
          \     /
           \   /
            \ /
             '
        </StringArg0>
        <BoolArg0>true</BoolArg0>
        <IntArg0>-1000</IntArg0>
    </SimpleUnittestMethod>
</soap:Body>
</soap:Envelope>
